lisp/clbe/clbe-1.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2021-09-06 Mon 01:59 -->
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>Introduction</title>
<meta name="generator" content="Org mode">
<meta name="author" content="Ashok Khanna">
 <meta http-equiv="X-UA-Compatible" content="IE=edge">
<meta name="viewport" content="width=device-width, initial-scale=1">
<link rel="stylesheet" type="text/css" href="/css/style.css" />
</head>
<body>
<div id="preamble" class="status">
<div id="quote">Ashok Khanna</div>
<div id="home-link"><a href="/index.html">Home</a></div>
<div id="articles-link"><a href="/articles.html">Articles</a></div>
<div id="resources-link"><a href="/resources.html">Resources</a></div>
</div>
<div id="content">
<h1 class="title">Introduction</h1>
<p>
Previous: <a href="clbe-0.html">0. Preface</a>
</p>

<p>
Next: <a href="clbe-2.html">2. Symbols &amp; Data Objects</a>
</p>

<p>
Lisp is an interactive language and all Lisp systems will include an
interactive front-end known as the toplevel. We can enter Lisp expressions
into the toplevel and Lisp will evaluate them and print their value.
This is known as the Read-Eval-Print-Loop, or REPL for short. Lisp
expressions that are meant to be evaluated are known as forms.
</p>

<p>
Atoms are the most basic unit of Lisp, representing singular objects,
such as the number <code>5</code> and the string “Hello, World!”. Lists are
collections of atoms or other lists, separated by whitespace and
enclosed in parenthesis, such as <code>(1 2 3)</code> or <code>(“Michael” “David”
“Ben”)</code>. An example of a nested list would be <code>((1 2 3) 4 5 6)</code>.
</p>

<p>
Lisp utilises prefix notation throughout the language, meaning
operators precede their arguments. As an example, we would calculate
<code>2 + 3 as (+ 2 3)</code>.
</p>

<div id="outline-container-orgf8db869" class="outline-2">
<h2 id="orgf8db869">Evaluation of Forms</h2>
<div class="outline-text-2" id="text-orgf8db869">
<p>
Lisp applies a consistent set of evaluation rules for atomic and list
forms. It is very important to have a deep understanding of Lisp’s
evaluation rules and this is the most important section of this guide.
</p>

<p>
Atoms evaluate to themselves. For example, the number <code>8</code> appearing as
an atom within Lisp code will evaluate to <code>8</code> and the string <code>“Color
is gold”</code> will evaluate to itself. This rule also applies to atomic
symbols (discussed shortly), which will evaluate to the value bound to
the symbol or return an error if the value is unbound. Note that lists
themselves are a collection of atoms; in evaluating a list, we need to
evaluate each of the atoms individually and then apply the rules for
the evaluation of the list.
</p>

<p>
Lisp will evaluate a list by looking up its first element and
determining whether it represents the start of one of four types of
forms: function, special, macro or lambda. A list whose first element
is the symbol for a function name is known as a function form. Lisp
will evaluate the remaining elements of a function form and pass them
as arguments to the function bound to (i.e. named by) the symbol. For
example, the below form evaluates the arguments to 10, 5 and 15
respectively (each itself a result of a function), and pass them to
the function call to return 30:
</p>

<div class="org-src-container">
<pre class="src src-lisp">
<span style="color: #b22222;">;; </span><span style="color: #b22222;">Returns 30:</span>

(+ (+ 5 5) (* 5 1) (+ 10 5))

</pre>
</div>

<p>
The evaluation rule for functions is not suitable for all
scenarios. For example, in an IF conditional, we only want the true
statement to be evaluated if the condition is true and we only want
the false statement to be evaluated if the condition is false. For
example, in the below, we only want to divide 10 by the value stored
in X if it is not zero (as otherwise we will get divide-by-zero
error). In an IF conditional, and in many other language constructs,
we do not want each element of the list to be evaluated.
</p>

<div class="org-src-container">
<pre class="src src-lisp">
(<span style="color: #a020f0;">defparameter</span> <span style="color: #a0522d;">x</span> 0)

(<span style="color: #a020f0;">if</span> (zerop X) <span style="color: #b22222;">; Test if x = 0</span>
    <span style="color: #8b2252;">"Cannot divide as X is zero"</span> <span style="color: #b22222;">; Do this if x = 0</span>
  (/ 10 X)) <span style="color: #b22222;">; Do this if x not 0</span>

</pre>
</div>

<p>
Common Lisp has 25 special forms, representing primitive functions
with their own specific evaluation rules. The evaluation rule for the
IF special form is to evaluate the true statement only if the
condition is true and the false statement only if the condition is
false. We will discuss the evaluation rules for common special forms
in the remainder of this guide.
</p>

<p>
Finally, Lisp also has specific evaluation rules for macro and lambda
forms. We will discuss these forms in greater depth towards the end of
this guide. During this guide however we will sporadically introduce
some of Common Lisp’s built-in macros. For now, we can treat them
similarly to special forms, noting each macro has a specific
evaluation rule.
</p>

<p>
Try entering the following list into our toplevel. You will receive an
error. This is because Lisp will look at the first element 1 and is
unable to evaluate it as one of the four compound forms we discussed
as 1 is a number, not the name of a function, special form or macro:
</p>

<div class="org-src-container">
<pre class="src src-lisp">
(1 2 3)

</pre>
</div>
</div>
</div>

<div id="outline-container-org1ceeb7c" class="outline-2">
<h2 id="org1ceeb7c">Controlling Evaluation</h2>
<div class="outline-text-2" id="text-org1ceeb7c">
<p>
The quote special form is used to override the above evaluation rules by
returning back the object literally without evaluation. For example, either
of the below two forms will evaluate without error as Lisp is no longer
evaluating the list <code>(1 2 3)</code>, but rather returning it literally:
</p>

<div class="org-src-container">
<pre class="src src-lisp">
(quote (1 2 3))

<span style="color: #b22222;">;; </span><span style="color: #b22222;">' is the shorthand for quote:</span>

'(1 2 3)

</pre>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="Date">Last updated: 24 July 2021</p><script src="/scripts/main.js"></script>
</div>
</body>
</html>
